app/controllers/jokes_controller.rb

  def index
    @jokes = Joke.all
---
SELECT "jokes".* FROM "jokes"

  def show
    @joke = Joke.find(params[:id])
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @joke = Joke.new params[:joke]

    if @joke.save
---
INSERT INTO "jokes" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 25 Apr 2014 22:48:56 UTC +00:00], ["title", "accusantium"], ["updated_at", Fri, 25 Apr 2014 22:48:56 UTC +00:00]]