app/controllers/jokes_controller.rb

  def show
    @joke = Joke.find(params[:id])
    @all_replies = @joke.replies.all.reverse
---
SELECT "replies".* FROM "replies" WHERE "replies"."joke_id" = 1