app/controllers/replies_controller.rb

  def new
    @reply = Reply.new
    @joke = Joke.find(params[:joke_id])
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", "1"]]