app/controllers/replies_controller.rb

  def index
    @replies = Reply.all
---
SELECT "replies".* FROM "replies"

  def show
    # need test for @joke
    @joke = Joke.find(params[:joke_id])
    @reply = Reply.find(params[:id])
---
SELECT "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    joke = Joke.find params[:joke_id]
    @reply = joke.replies.build params[:reply]
    if @reply.save
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "replies" ("content", "created_at", "joke_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Nihil debitis odio eum itaque eos magnam."], ["created_at", Fri, 25 Apr 2014 22:48:55 UTC +00:00], ["joke_id", 1], ["updated_at", Fri, 25 Apr 2014 22:48:55 UTC +00:00]]