app/controllers/votes_controller.rb

INSERT INTO "votes" ("created_at", "updated_at", "votable_id", "votable_type") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 25 Apr 2014 23:01:35 UTC +00:00], ["updated_at", Fri, 25 Apr 2014 23:01:35 UTC +00:00], ["votable_id", nil], ["votable_type", nil]]
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 1]]
---
  def create
    # @votes = 0
    p "$ "*30
    p poo
    if params[:up] == "true"
      if params[:joke_id] != nil
        @reply = Reply.find(params[:id])
        @reply.votes << Vote.create
        @votes = @reply.votes.length
      else
        @joke = Joke.find(params[:id])
        @joke.votes << Vote.create
        @votes = @joke.votes.length
      end
    else
      if params[:joke_id] != nil
        @reply = Reply.find(params[:id])
        @reply.votes.last.destroy